Stc89/Basics/sch&pcb/STC8GSCH/stc15xx-STC8-sch-pcb-library_ver1.0_20200530/stc15xx-STC8-sch-pcb-library/stc8_iar.h
/***************************************************************************
 *                                - STC8_IAR.h -
 *
 * Special header for the STC STC8 family Microcontroller.
 *
 ***************************************************************************/

#ifndef IO_STC8_H
#define IO_STC8_H
#define __STC8__
#ifdef __IAR_SYSTEMS_ICC__
#ifndef _SYSTEM_BUILD
   #pragma system_include
#endif
#pragma language=save
#pragma language=extended

__sfr __no_init volatile union
{ 
    unsigned char P0;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } P0_bit;
} @ 0x80;

__sfr __no_init volatile union
{ 
    unsigned char SP;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } SP_bit;
} @ 0x81;

__sfr __no_init volatile union
{ 
    unsigned char DPL;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } DPL_bit;
} @ 0x82;

__sfr __no_init volatile union
{ 
    unsigned char DPH;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } DPH_bit;
} @ 0x83;

__sfr __no_init volatile union
{ 
    unsigned char S4CON;
    struct
        {
            unsigned char S4SM0 : 1;
            unsigned char S4ST4 : 1;
            unsigned char S4SM2 : 1;
            unsigned char S4REN : 1;
            unsigned char S4TB8 : 1;
            unsigned char S4RB8 : 1;
            unsigned char S4TI  : 1;
            unsigned char S4RI  : 1;
        } S4CON_bit;
} @ 0x84;

__sfr __no_init volatile union
{ 
    unsigned char S4BUF;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } S4BUF_bit;
} @ 0x85;

__sfr __no_init volatile union
{
    unsigned char PCON;
    struct
    {
        unsigned char SMOD  : 1;
        unsigned char SMOD0 : 1;
        unsigned char LVDF  : 1;
        unsigned char POF   : 1;
        unsigned char GF1   : 1;
        unsigned char GF0   : 1;
        unsigned char PD    : 1;
        unsigned char IDL   : 1;
    } PCON_bit;
} @ 0x87;

__sfr __no_init volatile union
{ 
    unsigned char TCON;
    struct
    {
        unsigned char TF1 : 1;
        unsigned char TR1 : 1;
        unsigned char TF0 : 1;
        unsigned char TR0 : 1;
        unsigned char IE1 : 1;
        unsigned char IT1 : 1;
        unsigned char IE0 : 1;
        unsigned char IT0 : 1;
    } TCON_bit;
} @ 0x88;

__sfr __no_init volatile union
{ 
unsigned char TMOD;
    struct
    {
        unsigned char GATE1 : 1;
        unsigned char C_T1  : 1;
        unsigned char M11   : 1;
        unsigned char M01   : 1;
        unsigned char GATE0 : 1;
        unsigned char C_T0  : 1;
        unsigned char M10   : 1;
        unsigned char M00   : 1;
    } TMOD_bit;
} @ 0x89;

__sfr __no_init volatile union
{ 
    unsigned char TL0;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } TL0_bit;
} @ 0x8A;

__sfr __no_init volatile union
{ 
    unsigned char TL1;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } TL1_bit;
} @ 0x8B;

__sfr __no_init volatile union
{ 
    unsigned char TH0;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } TH0_bit;
} @ 0x8C;

__sfr __no_init volatile union
{ 
    unsigned char TH1;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } TH1_bit;
} @ 0x8D;

__sfr __no_init volatile union
{ 
    unsigned char AUXR;
    struct
    {
        unsigned char T0x12     : 1;
        unsigned char T1x12     : 1;
        unsigned char UART_M0x6 : 1;
        unsigned char T2R       : 1;
        unsigned char T2_C_T    : 1;
        unsigned char T2x12     : 1;
        unsigned char EXTRAM    : 1;
        unsigned char S1ST2     : 1;
    } AUXR_bit;
} @ 0x8E;

__sfr __no_init volatile union
{ 
    unsigned char INTCLKO;
    struct
    {
        unsigned char        : 1;
        unsigned char EX4    : 1;
        unsigned char EX3    : 1;
        unsigned char EX2    : 1;
        unsigned char        : 1;
        unsigned char T2CLKO : 1;
        unsigned char T1CLKO : 1;
        unsigned char T0CLKO : 1;
    } INTCLKO_bit;
} @ 0x8F;

__sfr __no_init volatile union
{ 
    unsigned char P1;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } P1_bit;
} @ 0x90;

__sfr __no_init volatile union
{ 
unsigned char P1M1;
struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } P1M1_bit;
} @ 0x91;

