Stc89/Basics/sch&pcb/STC8GSCH/stc15xx-STC8-sch-pcb-library_ver1.0_20200530/stc15xx-STC8-sch-pcb-library/stc8_iar.h
__sfr __no_init volatile union
{ 
    unsigned char P1M0;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } P1M0_bit;
} @ 0x92;

__sfr __no_init volatile union
{ 
    unsigned char P0M1;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } P0M1_bit;
} @ 0x93;

__sfr __no_init volatile union
{ 
    unsigned char P0M0;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } P0M0_bit;
} @ 0x94;

__sfr __no_init volatile union
{ 
    unsigned char P2M1;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } P2M1_bit;
} @ 0x95;

__sfr __no_init volatile union
{ 
    unsigned char P2M0;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } P2M0_bit;
} @ 0x96;

__sfr __no_init volatile union
{ 
    unsigned char AUXR2;
    struct
    {
        unsigned char        : 1;
        unsigned char        : 1;
        unsigned char        : 1;
        unsigned char TXLNRX : 1;
        unsigned char        : 1;
        unsigned char        : 1;
        unsigned char        : 1;
        unsigned char        : 1;
    } AUXR2_bit;
} @ 0x97;

__sfr __no_init volatile union
{ 
    unsigned char SCON;
    struct
    {
        unsigned char SM0_FE : 1;
        unsigned char SM1    : 1;
        unsigned char SM2    : 1;
        unsigned char REN    : 1;
        unsigned char TB8    : 1;
        unsigned char RB8    : 1;
        unsigned char TI     : 1;
        unsigned char RI     : 1;
    } SCON_bit;
} @ 0x98;

__sfr __no_init volatile union
{ 
    unsigned char SBUF;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } SBUF_bit;
} @ 0x99;

__sfr __no_init volatile union
{ 
    unsigned char S2CON;
    struct
    {
        unsigned char S2SM0 : 1;
        unsigned char       : 1;
        unsigned char S2SM2 : 1;
        unsigned char S2REN : 1;
        unsigned char S2TB8 : 1;
        unsigned char S2RB8 : 1;
        unsigned char S2TI  : 1;
        unsigned char S2RI  : 1;
    } S2CON_bit;
} @ 0x9A;

__sfr __no_init volatile union
{ 
    unsigned char S2BUF;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } S2BUF_bit;
} @ 0x9B;

__sfr __no_init volatile union
{ 
    unsigned char LIRTRIM;
    struct
    {
        unsigned char         : 1;
        unsigned char         : 1;
        unsigned char         : 1;
        unsigned char         : 1;
        unsigned char         : 1;
        unsigned char         : 1;
        unsigned char LIRTRIM : 2;
    } LIRTRIM_bit;
} @ 0x9E;

__sfr __no_init volatile union
{ 
    unsigned char IRTRIM;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } IRTRIM_bit;
} @ 0x9F;

__sfr __no_init volatile union
{ 
    unsigned char P2;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } P2_bit;
} @ 0xA0;

__sfr __no_init volatile union
{ 
    unsigned char BUS_SPEED;
    struct
    {
        unsigned char RW_S  : 2; 
        unsigned char       : 1;
        unsigned char       : 1;
        unsigned char       : 1;
        unsigned char       : 1;
        unsigned char SPEED : 2;
    } BUS_SPEED_bit;
} @ 0xA1;

__sfr __no_init volatile union
{ 
    unsigned char P_SW1;
    struct
    {
        unsigned char  S1_S  : 2;
        unsigned char  CCP_S : 2;
        unsigned char  SPI_S : 2;
        unsigned char        : 1;
        unsigned char        : 1;
    } P_SW1_bit;
} @ 0xA2;

__sfr __no_init volatile union
{ 
    unsigned char IE;
    struct
    {
        unsigned char EA   : 1;
        unsigned char ELVD : 1;
        unsigned char EADC : 1;
        unsigned char ES   : 1;
        unsigned char ET1  : 1;
        unsigned char EX1  : 1;
        unsigned char ET0  : 1;
        unsigned char EX0  : 1;
    } IE_bit;
} @ 0xA8;

__sfr __no_init volatile union
{ 
    unsigned char SADDR;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } SADDR_bit;
} @ 0xA9;

__sfr __no_init volatile union
{ 
    unsigned char WKTCL;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } WKTCL_bit;
} @ 0xAA;

__sfr __no_init volatile union
{ 
    unsigned char WKTCH;
    struct
    {
        unsigned char WKTEN : 1;
        unsigned char       : 1;
        unsigned char       : 1;
        unsigned char       : 1;
        unsigned char       : 1;
        unsigned char       : 1;
        unsigned char       : 1;
        unsigned char       : 1;
    } WKTCH_bit;
} @ 0xAB;

