Stc89/Basics/sch&pcb/STC8GSCH/stc15xx-STC8-sch-pcb-library_ver1.0_20200530/stc15xx-STC8-sch-pcb-library/stc8_iar.h
__sfr __no_init volatile union
{ 
    unsigned char S3CON;
    struct
    {
        unsigned char S3SM0 : 1;
        unsigned char S3ST3 : 1;
        unsigned char S3SM2 : 1;
        unsigned char S3REN : 1;
        unsigned char S3TB8 : 1;
        unsigned char S3RB8 : 1;
        unsigned char S3TI  : 1;
        unsigned char S3RI  : 1;
    } S3CON_bit;
} @ 0xAC;

__sfr __no_init volatile union
{ 
    unsigned char S3BUF;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } S3BUF_bit;
} @ 0xAD;

__sfr __no_init volatile union
{ 
    unsigned char TA;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } TA_bit;
} @ 0xAE;

__sfr __no_init volatile union
{ 
    unsigned char IE2;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } IE2_bit;
} @ 0xAF;

__sfr __no_init volatile union
{ 
    unsigned char P3;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } P3_bit;
} @ 0xB0;

__sfr __no_init volatile union
{ 
    unsigned char P3M1;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } P3M1_bit;
} @ 0xB1;

__sfr __no_init volatile union
{ 
    unsigned char P3M0;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } P3M0_bit;
} @ 0xB2;

__sfr __no_init volatile union
{ 
    unsigned char P4M1;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } P4M1_bit;
} @ 0xB3;

__sfr __no_init volatile union
{ 
    unsigned char P4M0;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } P4M0_bit;
} @ 0xB4;

__sfr __no_init volatile union
{ 
    unsigned char IP2;
    struct
    {
        unsigned char PCAN   : 1;
        unsigned char PI2C   : 1;
        unsigned char PCMP   : 1;
        unsigned char PX4    : 1;
        unsigned char PPWMFD : 1;
        unsigned char PPWM   : 1;
        unsigned char PSPI   : 1;
        unsigned char PS2    : 1;
    } IP2_bit;
} @ 0xB5;

__sfr __no_init volatile union
{ 
    unsigned char IP2H;
    struct
    {
        unsigned char PCANH   : 1;
        unsigned char PI2CH   : 1;
        unsigned char PCMPH   : 1;
        unsigned char PX4H    : 1;
        unsigned char PPWMFDH : 1;
        unsigned char PPWMH   : 1;
        unsigned char PSPIH   : 1;
        unsigned char PS2H    : 1;
    } IP2H_bit;
} @ 0xB6;

__sfr __no_init volatile union
{ 
    unsigned char IPH;
    struct
    {
        unsigned char PPCAH : 1;
        unsigned char PLVDH : 1;
        unsigned char PADCH : 1;
        unsigned char PSH   : 1;
        unsigned char PT1H  : 1;
        unsigned char PX1H  : 1;
        unsigned char PT0H  : 1;
        unsigned char PX0H  : 1;
    } IPH_bit;
} @ 0xB7;

__sfr __no_init volatile union
{ 
    unsigned char IP;
    struct
    {
        unsigned char PPCA : 1;
        unsigned char PLVD : 1;
        unsigned char PADC : 1;
        unsigned char PS   : 1;
        unsigned char PT1  : 1;
        unsigned char PX1  : 1;
        unsigned char PT0  : 1;
        unsigned char PX0  : 1;
    } IP_bit;
} @ 0xB8;

__sfr __no_init volatile union
{ 
    unsigned char SADEN;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } SADEN_bit;
} @ 0xB9;

__sfr __no_init volatile union
{ 
    unsigned char P_SW2;
    struct
    {
        unsigned char EAXFR  : 1;
        unsigned char CAN_S  : 1;
        unsigned char I2C_S  : 2;
        unsigned char CMPO_S : 1;
        unsigned char S4_S   : 1;
        unsigned char S3_S   : 1;
        unsigned char S2_S   : 1;
    } P_SW2_bit;
} @ 0xBA;

__sfr __no_init volatile union
{ 
    unsigned char VOCTRL;
    struct
    {
        unsigned char SCC : 1;
        unsigned char     : 1;
        unsigned char     : 1;
        unsigned char     : 1;
        unsigned char     : 1;
        unsigned char     : 1;
        unsigned char     : 1;
        unsigned char     : 1;
    } VOCTRL_bit;
} @ 0xBB;

__sfr __no_init volatile union
{ 
    unsigned char ADC_CONTR;
    struct
    {
        unsigned char ADC_POWER : 1;
        unsigned char ADC_START : 1;
        unsigned char ADC_FLAG  : 1;
        unsigned char           : 1;
        unsigned char ADC_CHS   : 4;
    } ADC_CONTR_bit;
} @ 0xBC;

__sfr __no_init volatile union
{ 
    unsigned char ADC_RES;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } ADC_RES_bit;
} @ 0xBD;

