Stc89/Basics/sch&pcb/STC8GSCH/stc15xx-STC8-sch-pcb-library_ver1.0_20200530/stc15xx-STC8-sch-pcb-library/stc8_iar.h
__sfr __no_init volatile union
{ 
    unsigned char ADC_RESL;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } ADC_RESL_bit;
} @ 0xBE;

__sfr __no_init volatile union
{ 
    unsigned char P4;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } P4_bit;
} @ 0xC0;

__sfr __no_init volatile union
{ 
    unsigned char WDT_CONTR;
    struct
    {
        unsigned char WDT_FLAG : 1;
        unsigned char -        : 1;
        unsigned char EN_WDT   : 1;
        unsigned char CLR_WDT  : 1;
        unsigned char IDL_WDT  : 1;
        unsigned char WDT_PS   : 3;
    } WDT_CONTR_bit;
} @ 0xC1;

__sfr __no_init volatile union
{ 
    unsigned char IAP_DATA;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } IAP_DATA_bit;
} @ 0xC2;

__sfr __no_init volatile union
{ 
    unsigned char IAP_ADDRH;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } IAP_ADDRH_bit;
} @ 0xC3;

__sfr __no_init volatile union
{ 
    unsigned char IAP_ADDRL;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } IAP_ADDRL_bit;
} @ 0xC4;

__sfr __no_init volatile union
{ 
    unsigned char IAP_CMD;
    struct
    {
        unsigned char     : 1;
        unsigned char     : 1;
        unsigned char     : 1;
        unsigned char     : 1;
        unsigned char     : 1;
        unsigned char     : 1;
        unsigned char CMD : 2;
    } IAP_CMD_bit;
} @ 0xC5;

__sfr __no_init volatile union
{ 
    unsigned char IAP_TRIG;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } IAP_TRIG_bit;
} @ 0xC6;

__sfr __no_init volatile union
{ 
    unsigned char IAP_CONTR;
    struct
    {
        unsigned char IAPEN    : 1;
        unsigned char SWBS     : 1;
        unsigned char SWRST    : 1;
        unsigned char CMD_FAIL : 1;
        unsigned char          : 1;
        unsigned char IAP_WT   : 3;
    } IAP_CONTR_bit;
} @ 0xC7;

__sfr __no_init volatile union
{ 
    unsigned char P5;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } P5_bit;
} @ 0xC8;

__sfr __no_init volatile union
{ 
    unsigned char P5M1;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } P5M1_bit;
} @ 0xC9;

__sfr __no_init volatile union
{ 
    unsigned char P5M0;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } P5M0_bit;
} @ 0xCA;

__sfr __no_init volatile union
{ 
    unsigned char P6M1;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } P6M1_bit;
} @ 0xCB;

__sfr __no_init volatile union
{ 
    unsigned char P6M0;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } P6M0_bit;
} @ 0xCC;

__sfr __no_init volatile union
{ 
    unsigned char SPSTAT;
    struct
    {
        unsigned char SPIF : 1;
        unsigned char WCOL : 1;
        unsigned char      : 1;
        unsigned char      : 1;
        unsigned char      : 1;
        unsigned char      : 1;
        unsigned char      : 1;
        unsigned char      : 1;
    } SPSTAT_bit;
} @ 0xCD;

__sfr __no_init volatile union
{ 
    unsigned char SPCTL;
    struct
    {
        unsigned char SSIG : 1;
        unsigned char SPEN : 1;
        unsigned char DORD : 1;
        unsigned char MSTR : 1;
        unsigned char CPOL : 1;
        unsigned char CPHA : 1;
        unsigned char SPR  : 2;
    } SPCTL_bit;
} @ 0xCE;

__sfr __no_init volatile union
{ 
    unsigned char SPDAT;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } SPDAT_bit;
} @ 0xCF;

__sfr __no_init volatile union
{ 
    unsigned char PSW;
    struct
    {
        unsigned char CY  : 1;
        unsigned char AC  : 1;
        unsigned char F0  : 1;
        unsigned char RS1 : 1;
        unsigned char RS0 : 1;
        unsigned char OV  : 1;
        unsigned char     : 1;
        unsigned char P   : 1;
    } PSW_bit;
} @ 0xD0;

__sfr __no_init volatile union
{ 
    unsigned char T4T3M;
    struct
    {
        unsigned char T4R    : 1;
        unsigned char T4_CT  : 1;
        unsigned char T4x12  : 1;
        unsigned char T4CLKO : 1;
        unsigned char T3R    : 1;
        unsigned char T3_CT  : 1;
        unsigned char T3x12  : 1;
        unsigned char T3CLKO : 1;
    } T4T3M_bit;
} @ 0xD1;

