Stc89/Basics/sch&pcb/STC8GSCH/stc15xx-STC8-sch-pcb-library_ver1.0_20200530/stc15xx-STC8-sch-pcb-library/stc8_iar.h
__sfr __no_init volatile union
{ 
    unsigned char T4H;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } T4H_bit;
} @ 0xD2;

__sfr __no_init volatile union
{ 
    unsigned char T4L;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } T4L_bit;
} @ 0xD3;

__sfr __no_init volatile union
{ 
    unsigned char T3H;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } T3H_bit;
} @ 0xD4;

__sfr __no_init volatile union
{ 
    unsigned char T3L;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } T3L_bit;
} @ 0xD5;

__sfr __no_init volatile union
{ 
    unsigned char T2H;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } T2H_bit;
} @ 0xD6;

__sfr __no_init volatile union
{ 
    unsigned char T2L;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } T2L_bit;
} @ 0xD7;

__sfr __no_init volatile union
{ 
    unsigned char CCON;
    struct
    {
        unsigned char CF   : 1;
        unsigned char CR   : 1;
        unsigned char      : 1;
        unsigned char      : 1;
        unsigned char CCF3 : 1;
        unsigned char CCF2 : 1;
        unsigned char CCF1 : 1;
        unsigned char CCF0 : 1;
    } CCON_bit;
} @ 0xD8;

__sfr __no_init volatile union
{ 
    unsigned char CMOD;
    struct
    {
        unsigned char CIDL : 1;
        unsigned char      : 1;
        unsigned char      : 1;
        unsigned char      : 1;
        unsigned char CPS  : 3;
        unsigned char ECF  : 1;
    } CMOD_bit;
} @ 0xD9;

__sfr __no_init volatile union
{ 
    unsigned char CCAPM0;
    struct
    {
        unsigned char        : 1;
        unsigned char ECOM0  : 1;
        unsigned char CCAPP0 : 1;
        unsigned char CCAPN0 : 1;
        unsigned char MAT0   : 1;
        unsigned char TOG0   : 1;
        unsigned char PWM0   : 1;
        unsigned char ECCF0  : 1;
    } CCAPM0_bit;
} @ 0xDA;

__sfr __no_init volatile union
{ 
    unsigned char CCAPM1;
    struct
    {
        unsigned char        : 1;
        unsigned char ECOM1  : 1;
        unsigned char CCAPP1 : 1;
        unsigned char CCAPN1 : 1;
        unsigned char MAT1   : 1;
        unsigned char TOG1   : 1;
        unsigned char PWM1   : 1;
        unsigned char ECCF1  : 1;
    } CCAPM1_bit;
} @ 0xDB;

__sfr __no_init volatile union
{ 
    unsigned char CCAPM2;
    struct
    {
        unsigned char        : 1;
        unsigned char ECOM2  : 1;
        unsigned char CCAPP2 : 1;
        unsigned char CCAPN2 : 1;
        unsigned char MAT2   : 1;
        unsigned char TOG2   : 1;
        unsigned char PWM2   : 1;
        unsigned char ECCF2  : 1;
    } CCAPM2_bit;
} @ 0xDC;

__sfr __no_init volatile union
{ 
    unsigned char CCAPM3;
    struct
    {
        unsigned char        : 1;
        unsigned char ECOM3  : 1;
        unsigned char CCAPP3 : 1;
        unsigned char CCAPN3 : 1;
        unsigned char MAT3   : 1;
        unsigned char TOG3   : 1;
        unsigned char PWM3   : 1;
        unsigned char ECCF3  : 1;
    } CCAPM3_bit;
} @ 0xDD;

__sfr __no_init volatile union
{ 
    unsigned char IP3;
    struct
    {
        unsigned char     : 1;
        unsigned char     : 1;
        unsigned char     : 1;
        unsigned char     : 1;
        unsigned char     : 1;
        unsigned char     : 1;
        unsigned char PS4 : 1;
        unsigned char PS3 : 1;
    } IP3_bit;
} @ 0xDF;

__sfr __no_init volatile union
{ 
    unsigned char ADCCFG;
    struct
    {
        unsigned char        : 1;
        unsigned char        : 1;
        unsigned char RESFMT : 1;
        unsigned char        : 1;
        unsigned char SPEED  : 4;
    } ADCCFG_bit;
} @ 0xDE;

__sfr __no_init volatile union
{ 
    unsigned char ACC;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } ACC_bit;
} @ 0xE0;

__sfr __no_init volatile union
{ 
    unsigned char P7M1;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } P7M1_bit;
} @ 0xE1;

__sfr __no_init volatile union
{ 
    unsigned char P7M0;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } P7M0_bit;
} @ 0xE2;

__sfr __no_init volatile union
{ 
    unsigned char DPS;
    struct
    {
        unsigned char ID1 : 1;
        unsigned char ID0 : 1;
        unsigned char TSL : 1;
        unsigned char AU1 : 1;
        unsigned char AU0 : 1;
        unsigned char     : 1;
        unsigned char     : 1;
        unsigned char SEL : 1;
    } DPS_bit;
} @ 0xE3;

__sfr __no_init volatile union
{ 
    unsigned char DPL1;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } DPL1_bit;
} @ 0xE4;

