Stc89/Basics/sch&pcb/STC8GSCH/stc15xx-STC8-sch-pcb-library_ver1.0_20200530/stc15xx-STC8-sch-pcb-library/stc8_iar.h
__sfr __no_init volatile union
{ 
    unsigned char DPH1;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } DPH1_bit;
} @ 0xE5;

__sfr __no_init volatile union
{ 
    unsigned char CMPCR1;
    struct
    {
        unsigned char CMPEN  : 1;
        unsigned char CMPIF  : 1;
        unsigned char PIE    : 1;
        unsigned char NIE    : 1;
        unsigned char PIS    : 1;
        unsigned char NIS    : 1;
        unsigned char CMPOE  : 1;
        unsigned char CMPRES : 1;
    } CMPCR1_bit;
} @ 0xE6;

__sfr __no_init volatile union
{ 
    unsigned char CMPCR2;
    struct
    {
        unsigned char INVCMPO : 1;
        unsigned char DISFLT  : 1;
        unsigned char LCDTY   : 6;
    } CMPCR2_bit;
} @ 0xE7;

__sfr __no_init volatile union
{ 
    unsigned char P6;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } P6_bit;
} @ 0xE8;

__sfr __no_init volatile union
{ 
    unsigned char CL;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } CL_bit;
} @ 0xE9;

__sfr __no_init volatile union
{ 
    unsigned char CCAP0L;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } CCAP0L_bit;
} @ 0xEA;

__sfr __no_init volatile union
{ 
    unsigned char CCAP1L;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } CCAP1L_bit;
} @ 0xEB;

__sfr __no_init volatile union
{ 
    unsigned char CCAP2L;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } CCAP2L_bit;
} @ 0xEC;

__sfr __no_init volatile union
{ 
    unsigned char CCAP3L;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } CCAP3L_bit;
} @ 0xED;

__sfr __no_init volatile union
{ 
    unsigned char IP3H;
    struct
    {
        unsigned char      : 1;
        unsigned char      : 1;
        unsigned char      : 1;
        unsigned char      : 1;
        unsigned char      : 1;
        unsigned char      : 1;
        unsigned char PS4H : 1;
        unsigned char PS3H : 1;
    } IP3H_bit;
} @ 0xEE;

__sfr __no_init volatile union
{ 
    unsigned char AUXINTIF;
    struct
    {
        unsigned char        : 1;
        unsigned char INT4IF : 1;
        unsigned char INT3IF : 1;
        unsigned char INT2IF : 1;
        unsigned char        : 1;
        unsigned char T4IF   : 1;
        unsigned char T3IF   : 1;
        unsigned char T2IF   : 1;
    } AUXINTIF_bit;
} @ 0xEF;

__sfr __no_init volatile union
{ 
    unsigned char B;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } B_bit;
} @ 0xF0;

__sfr __no_init volatile union
{ 
    unsigned char PWMCFG;
    struct
    {
        unsigned char CBIF  : 1;
        unsigned char ETADC : 1;
        unsigned char       : 1;
        unsigned char       : 1;
        unsigned char       : 1;
        unsigned char       : 1;
        unsigned char       : 1;
        unsigned char       : 1;
    } PWMCFG_bit;
} @ 0xF1;

__sfr __no_init volatile union
{ 
    unsigned char PCA_PWM0;
    struct
    {
        unsigned char EBS0    : 2;
        unsigned char XCCAP0H : 2;
        unsigned char XCCAP0L : 2;
        unsigned char EPC0H   : 1;
        unsigned char EPC0L   : 1;
    } PCA_PWM0_bit;
} @ 0xF2;

__sfr __no_init volatile union
{ 
    unsigned char PCA_PWM1;
    struct
    {
        unsigned char EBS1    : 2;
        unsigned char XCCAP1H : 2;
        unsigned char XCCAP1L : 2;
        unsigned char EPC1H   : 1;
        unsigned char EPC1L   : 1;
    } PCA_PWM1_bit;
} @ 0xF3;

__sfr __no_init volatile union
{ 
    unsigned char PCA_PWM2;
    struct
    {
        unsigned char EBS2    : 2;
        unsigned char XCCAP2H : 2;
        unsigned char XCCAP2L : 2;
        unsigned char EPC2H   : 1;
        unsigned char EPC2L   : 1;
    } PCA_PWM2_bit;
} @ 0xF4;

__sfr __no_init volatile union
{ 
    unsigned char PCA_PWM3;
    struct
    {
        unsigned char EBS3    : 2;
        unsigned char XCCAP3H : 2;
        unsigned char XCCAP3L : 2;
        unsigned char EPC3H   : 1;
        unsigned char EPC3L   : 1;
    } PCA_PWM3_bit;
} @ 0xF5;

__sfr __no_init volatile union
{ 
    unsigned char PWMIF;
    struct
    {
        unsigned char C7IF : 1;
        unsigned char C6IF : 1;
        unsigned char C5IF : 1;
        unsigned char C4IF : 1;
        unsigned char C3IF : 1;
        unsigned char C2IF : 1;
        unsigned char C1IF : 1;
        unsigned char C0IF : 1;
    } PWMFDCR_bit;
} @ 0xF6;

__sfr __no_init volatile union
{ 
    unsigned char PWMFDCR;
    struct
    {
        unsigned char INVCMP  : 1;
        unsigned char INVIO   : 1;
        unsigned char ENFD    : 1;
        unsigned char FLTFLIO : 1;
        unsigned char EFDI    : 1;
        unsigned char FDCMP   : 1;
        unsigned char FDIO    : 1;
        unsigned char FDIF    : 1;
    } PWMFDCR_bit;
} @ 0xF7;

