Stc89/Basics/sch&pcb/STC8GSCH/stc15xx-STC8-sch-pcb-library_ver1.0_20200530/stc15xx-STC8-sch-pcb-library/stc8_iar.h
__sfr __no_init volatile union
{ 
    unsigned char P7;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } P7_bit;
} @ 0xF8;

__sfr __no_init volatile union
{ 
    unsigned char CH;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } CH_bit;
} @ 0xF9;

__sfr __no_init volatile union
{ 
    unsigned char CCAP0H;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } CCAP0H_bit;
} @ 0xFA;

__sfr __no_init volatile union
{ 
    unsigned char CCAP1H;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } CCAP1H_bit;
} @ 0xFB;

__sfr __no_init volatile union
{ 
    unsigned char CCAP2H;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } CCAP2H_bit;
} @ 0xFC;

__sfr __no_init volatile union
{ 
    unsigned char CCAP3H;
    struct
    {
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
        unsigned char : 1;
    } CCAP3H_bit;
} @ 0xFD;

__sfr __no_init volatile union
{ 
    unsigned char PWMCR;
    struct
    {
        unsigned char ENPWM : 1;
        unsigned char ECB   : 1;
        unsigned char       : 1;
        unsigned char       : 1;
        unsigned char       : 1;
        unsigned char       : 1;
        unsigned char       : 1;
        unsigned char       : 1;
    } PWMCR_bit;
} @ 0xFE;

__sfr __no_init volatile union
{ 
    unsigned char RSTCFG;
    struct
    {
        unsigned char        : 1;
        unsigned char ENLVR  : 1;
        unsigned char        : 1;
        unsigned char P54RST : 1;
        unsigned char        : 1;
        unsigned char        : 1;
        unsigned char LVDS   : 2;
    } RSTCFG_bit;
} @ 0xFF;


__xdata __no_init volatile unsigned char PWMCH       @ 0xFFF0;
__xdata __no_init volatile unsigned char PWMCL       @ 0xFFF1;
__xdata __no_init volatile unsigned char PWMCKS      @ 0xFFF2;
__xdata __no_init volatile unsigned char TADCPH      @ 0xFFF3;
__xdata __no_init volatile unsigned char TADCPL      @ 0xFFF4;
__xdata __no_init volatile unsigned char PWM0T1H     @ 0xFF00;
__xdata __no_init volatile unsigned char PWM0T1L     @ 0xFF01;
__xdata __no_init volatile unsigned char PWM0T2H     @ 0xFF02;
__xdata __no_init volatile unsigned char PWM0T2L     @ 0xFF03;
__xdata __no_init volatile unsigned char PWM0CR      @ 0xFF04;
__xdata __no_init volatile unsigned char PWM0HLD     @ 0xFF05;
__xdata __no_init volatile unsigned char PWM1T1H     @ 0xFF10;
__xdata __no_init volatile unsigned char PWM1T1L     @ 0xFF11;
__xdata __no_init volatile unsigned char PWM1T2H     @ 0xFF12;
__xdata __no_init volatile unsigned char PWM1T2L     @ 0xFF13;
__xdata __no_init volatile unsigned char PWM1CR      @ 0xFF14;
__xdata __no_init volatile unsigned char PWM1HLD     @ 0xFF15;
__xdata __no_init volatile unsigned char PWM2T1H     @ 0xFF20;
__xdata __no_init volatile unsigned char PWM2T1L     @ 0xFF21;
__xdata __no_init volatile unsigned char PWM2T2H     @ 0xFF22;
__xdata __no_init volatile unsigned char PWM2T2L     @ 0xFF23;
__xdata __no_init volatile unsigned char PWM2CR      @ 0xFF24;
__xdata __no_init volatile unsigned char PWM2HLD     @ 0xFF25;
__xdata __no_init volatile unsigned char PWM3T1H     @ 0xFF30;
__xdata __no_init volatile unsigned char PWM3T1L     @ 0xFF31;
__xdata __no_init volatile unsigned char PWM3T2H     @ 0xFF32;
__xdata __no_init volatile unsigned char PWM3T2L     @ 0xFF33;
__xdata __no_init volatile unsigned char PWM3CR      @ 0xFF34;
__xdata __no_init volatile unsigned char PWM3HLD     @ 0xFF35;
__xdata __no_init volatile unsigned char PWM4T1H     @ 0xFF40;
__xdata __no_init volatile unsigned char PWM4T1L     @ 0xFF41;
__xdata __no_init volatile unsigned char PWM4T2H     @ 0xFF42;
__xdata __no_init volatile unsigned char PWM4T2L     @ 0xFF43;
__xdata __no_init volatile unsigned char PWM4CR      @ 0xFF44;
__xdata __no_init volatile unsigned char PWM4HLD     @ 0xFF45;
__xdata __no_init volatile unsigned char PWM5T1H     @ 0xFF50;
__xdata __no_init volatile unsigned char PWM5T1L     @ 0xFF51;
__xdata __no_init volatile unsigned char PWM5T2H     @ 0xFF52;
__xdata __no_init volatile unsigned char PWM5T2L     @ 0xFF53;
__xdata __no_init volatile unsigned char PWM5CR      @ 0xFF54;
__xdata __no_init volatile unsigned char PWM5HLD     @ 0xFF55;
__xdata __no_init volatile unsigned char PWM6T1H     @ 0xFF60;
__xdata __no_init volatile unsigned char PWM6T1L     @ 0xFF61;
__xdata __no_init volatile unsigned char PWM6T2H     @ 0xFF62;
__xdata __no_init volatile unsigned char PWM6T2L     @ 0xFF63;
__xdata __no_init volatile unsigned char PWM6CR      @ 0xFF64;
__xdata __no_init volatile unsigned char PWM6HLD     @ 0xFF65;
__xdata __no_init volatile unsigned char PWM7T1H     @ 0xFF70;
__xdata __no_init volatile unsigned char PWM7T1L     @ 0xFF71;
__xdata __no_init volatile unsigned char PWM7T2H     @ 0xFF72;
__xdata __no_init volatile unsigned char PWM7T2L     @ 0xFF73;
__xdata __no_init volatile unsigned char PWM7CR      @ 0xFF74;
__xdata __no_init volatile unsigned char PWM7HLD     @ 0xFF75;
__xdata __no_init volatile unsigned char I2CCFG      @ 0xFE80;
__xdata __no_init volatile unsigned char I2CMSCR     @ 0xFE81;
__xdata __no_init volatile unsigned char I2CMSST     @ 0xFE82;
__xdata __no_init volatile unsigned char I2CSLCR     @ 0xFE83;
__xdata __no_init volatile unsigned char I2CSLST     @ 0xFE84;
__xdata __no_init volatile unsigned char I2CSLADR    @ 0xFE85;
__xdata __no_init volatile unsigned char I2CTXD      @ 0xFE86;
__xdata __no_init volatile unsigned char I2CRXD      @ 0xFE87;
__xdata __no_init volatile unsigned char I2CMSAUX    @ 0xFE88;
__xdata __no_init volatile unsigned char P0PU        @ 0xFE10;
__xdata __no_init volatile unsigned char P1PU        @ 0xFE11;
__xdata __no_init volatile unsigned char P2PU        @ 0xFE12;
__xdata __no_init volatile unsigned char P3PU        @ 0xFE13;
__xdata __no_init volatile unsigned char P4PU        @ 0xFE14;
__xdata __no_init volatile unsigned char P5PU        @ 0xFE15;
__xdata __no_init volatile unsigned char P6PU        @ 0xFE16;
__xdata __no_init volatile unsigned char P7PU        @ 0xFE17;
__xdata __no_init volatile unsigned char P0NCS       @ 0xFE18;
__xdata __no_init volatile unsigned char P1NCS       @ 0xFE19;
__xdata __no_init volatile unsigned char P2NCS       @ 0xFE1A;
__xdata __no_init volatile unsigned char P3NCS       @ 0xFE1B;
__xdata __no_init volatile unsigned char P4NCS       @ 0xFE1C;
__xdata __no_init volatile unsigned char P5NCS       @ 0xFE1D;
__xdata __no_init volatile unsigned char P6NCS       @ 0xFE1E;
__xdata __no_init volatile unsigned char P7NCS       @ 0xFE1F;
__xdata __no_init volatile unsigned char CKSEL       @ 0xFE00;
__xdata __no_init volatile unsigned char CLKDIV      @ 0xFE01;
__xdata __no_init volatile unsigned char IRC24MCR    @ 0xFE02;
__xdata __no_init volatile unsigned char XOSCCR      @ 0xFE03;
__xdata __no_init volatile unsigned char IRC32KCR    @ 0xFE04;


