Stc89/Basics/sch&pcb/STC8GSCH/stc15xx-STC8-sch-pcb-library_ver1.0_20200530/stc15xx-STC8-sch-pcb-library/stc8_iar.h
/*
 * Interrupt Vectors
 */
#define extern0 0x03 /* External interrupt 0 */
#define timer0 0x0B /* Timer 0 Interrupt */
#define extern1 0x13 /* External interrupt 1 */
#define timer1 0x1B /* Timer 1 Interrupt */
#define sio_ti 0x23 /* Serial Port Interrupt */
#define sio_ri 0x23 /* Serial Port Interrupt */

#pragma language=restore
#endif  /* __IAR_SYSTEMS_ICC__  */

/***************************************************************************
 *   Assembler definitions
 *
 *   The following SFRs are built in in the a8051.exe and can not be
 *   defined explicitly in this file:
 *     ACC,B,PSW,SP,DPL,DPH
 *   The PSW-bits are built-in in the a8051.exe
 *     OV,AC,F0,RS0,RS1,P
 *
 ***************************************************************************/

#ifdef __IAR_SYSTEMS_ASM__

P0          DEFINE 0x80
SP          DEFINE 0x81
DPL         DEFINE 0x82
DPH         DEFINE 0x83
S4CON       DEFINE 0x84
S4BUF       DEFINE 0x85
PCON        DEFINE 0x87
TCON        DEFINE 0x88
TMOD        DEFINE 0x89
TL0         DEFINE 0x8A
TL1         DEFINE 0x8B
TH0         DEFINE 0x8C
TH1         DEFINE 0x8D
AUXR        DEFINE 0x8E
INTCLKO     DEFINE 0x8F
P1          DEFINE 0x90
P1M1        DEFINE 0x91
P1M0        DEFINE 0x92
P0M1        DEFINE 0x93
P0M0        DEFINE 0x94
P2M1        DEFINE 0x95
P2M0        DEFINE 0x96
AUXR2       DEFINE 0x97
SCON        DEFINE 0x98
SBUF        DEFINE 0x99
S2CON       DEFINE 0x9A
S2BUF       DEFINE 0x9B
LIRTRIM     DEFINE 0x9E
IRTRIM      DEFINE 0x9F
P2          DEFINE 0xA0
BUS_SPEED   DEFINE 0xA1
P_SW1       DEFINE 0xA2
IE          DEFINE 0xA8
SADDR       DEFINE 0xA9
WKTCL       DEFINE 0xAA
WKTCH       DEFINE 0xAB
S3CON       DEFINE 0xAC
S3BUF       DEFINE 0xAD
TA          DEFINE 0xAE
IE2         DEFINE 0xAF
P3          DEFINE 0xB0
P3M1        DEFINE 0xB1
P3M0        DEFINE 0xB2
P4M1        DEFINE 0xB3
P4M0        DEFINE 0xB4
IP2         DEFINE 0xB5
IP2H        DEFINE 0xB6
IPH         DEFINE 0xB7
IP          DEFINE 0xB8
SADEN       DEFINE 0xB9
P_SW2       DEFINE 0xBA
VOCTRL      DEFINE 0xBB
ADC_CONTR   DEFINE 0xBC
ADC_RES     DEFINE 0xBD
ADC_RESL    DEFINE 0xBE
P4          DEFINE 0xC0
P4          DEFINE 0xC0
WDT_CONTR   DEFINE 0xC1
IAP_DATA    DEFINE 0xC2
IAP_ADDRH   DEFINE 0xC3
IAP_ADDRL   DEFINE 0xC4
IAP_CMD     DEFINE 0xC5
IAP_TRIG    DEFINE 0xC6
IAP_CONTR   DEFINE 0xC7
P5          DEFINE 0xC8
P5M1        DEFINE 0xC9
P5M0        DEFINE 0xCA
P6M1        DEFINE 0xCB
P6M0        DEFINE 0xCC
SPSTAT      DEFINE 0xCD
SPCTL       DEFINE 0xCE
SPDAT       DEFINE 0xCF
PSW         DEFINE 0xD0
T4T3M       DEFINE 0xD1
T4H         DEFINE 0xD2
T4L         DEFINE 0xD3
T3H         DEFINE 0xD4
T3L         DEFINE 0xD5
T2H         DEFINE 0xD6
T2L         DEFINE 0xD7
CCON        DEFINE 0xD8
CMOD        DEFINE 0xD9
CCAPM0      DEFINE 0xDA
CCAPM1      DEFINE 0xDB
CCAPM2      DEFINE 0xDC
CCAPM3      DEFINE 0xDD
IP3         DEFINE 0xDF
ADCCFG      DEFINE 0xDE
ACC         DEFINE 0xE0
P7M1        DEFINE 0xE1
P7M0        DEFINE 0xE2
DPS         DEFINE 0xE3
DPL1        DEFINE 0xE4
DPH1        DEFINE 0xE5
CMPCR1      DEFINE 0xE6
CMPCR2      DEFINE 0xE7
P6          DEFINE 0xE8
CL          DEFINE 0xE9
CCAP0L      DEFINE 0xEA
CCAP1L      DEFINE 0xEB
CCAP2L      DEFINE 0xEC
CCAP3L      DEFINE 0xED
IP3H        DEFINE 0xEE
AUXINTIF    DEFINE 0xEF
B           DEFINE 0xF0
PWMCFG      DEFINE 0xF1
PCA_PWM0    DEFINE 0xF2
PCA_PWM1    DEFINE 0xF3
PCA_PWM2    DEFINE 0xF4
PCA_PWM3    DEFINE 0xF5
PWMIF       DEFINE 0xF6
PWMFDCR     DEFINE 0xF7
P7          DEFINE 0xF8
CH          DEFINE 0xF9
CCAP0H      DEFINE 0xFA
CCAP1H      DEFINE 0xFB
CCAP2H      DEFINE 0xFC
CCAP3H      DEFINE 0xFD
PWMCR       DEFINE 0xFE
RSTCFG      DEFINE 0xFF

PWMCH       DEFINE 0xFFF0
PWMCL       DEFINE 0xFFF1
PWMCKS      DEFINE 0xFFF2
TADCPH      DEFINE 0xFFF3
TADCPL      DEFINE 0xFFF4
PWM0T1H     DEFINE 0xFF00
PWM0T1L     DEFINE 0xFF01
PWM0T2H     DEFINE 0xFF02
PWM0T2L     DEFINE 0xFF03
PWM0CR      DEFINE 0xFF04
PWM0HLD     DEFINE 0xFF05
PWM1T1H     DEFINE 0xFF10
PWM1T1L     DEFINE 0xFF11
PWM1T2H     DEFINE 0xFF12
PWM1T2L     DEFINE 0xFF13
PWM1CR      DEFINE 0xFF14
PWM1HLD     DEFINE 0xFF15
PWM2T1H     DEFINE 0xFF20
PWM2T1L     DEFINE 0xFF21
PWM2T2H     DEFINE 0xFF22
PWM2T2L     DEFINE 0xFF23
PWM2CR      DEFINE 0xFF24
PWM2HLD     DEFINE 0xFF25
PWM3T1H     DEFINE 0xFF30
PWM3T1L     DEFINE 0xFF31
PWM3T2H     DEFINE 0xFF32
PWM3T2L     DEFINE 0xFF33
PWM3CR      DEFINE 0xFF34
PWM3HLD     DEFINE 0xFF35
PWM4T1H     DEFINE 0xFF40
PWM4T1L     DEFINE 0xFF41
PWM4T2H     DEFINE 0xFF42
PWM4T2L     DEFINE 0xFF43
PWM4CR      DEFINE 0xFF44
PWM4HLD     DEFINE 0xFF45
PWM5T1H     DEFINE 0xFF50
PWM5T1L     DEFINE 0xFF51
PWM5T2H     DEFINE 0xFF52
PWM5T2L     DEFINE 0xFF53
PWM5CR      DEFINE 0xFF54
PWM5HLD     DEFINE 0xFF55
PWM6T1H     DEFINE 0xFF60
PWM6T1L     DEFINE 0xFF61
PWM6T2H     DEFINE 0xFF62
PWM6T2L     DEFINE 0xFF63
PWM6CR      DEFINE 0xFF64
PWM6HLD     DEFINE 0xFF65
PWM7T1H     DEFINE 0xFF70
PWM7T1L     DEFINE 0xFF71
PWM7T2H     DEFINE 0xFF72
PWM7T2L     DEFINE 0xFF73
PWM7CR      DEFINE 0xFF74
PWM7HLD     DEFINE 0xFF75
I2CCFG      DEFINE 0xFE80
I2CMSCR     DEFINE 0xFE81
I2CMSST     DEFINE 0xFE82
I2CSLCR     DEFINE 0xFE83
I2CSLST     DEFINE 0xFE84
I2CSLADR    DEFINE 0xFE85
I2CTXD      DEFINE 0xFE86
I2CRXD      DEFINE 0xFE87
I2CMSAUX    DEFINE 0xFE88
P0PU        DEFINE 0xFE10
P1PU        DEFINE 0xFE11
P2PU        DEFINE 0xFE12
P3PU        DEFINE 0xFE13
P4PU        DEFINE 0xFE14
P5PU        DEFINE 0xFE15
P6PU        DEFINE 0xFE16
P7PU        DEFINE 0xFE17
P0NCS       DEFINE 0xFE18
P1NCS       DEFINE 0xFE19
P2NCS       DEFINE 0xFE1A
P3NCS       DEFINE 0xFE1B
P4NCS       DEFINE 0xFE1C
P5NCS       DEFINE 0xFE1D
P6NCS       DEFINE 0xFE1E
P7NCS       DEFINE 0xFE1F
CKSEL       DEFINE 0xFE00
CLKDIV      DEFINE 0xFE01
IRC24MCR    DEFINE 0xFE02
XOSCCR      DEFINE 0xFE03
IRC32KCR    DEFINE 0xFE04

P0_P00 DEFINE 0x80.0
P0_P01 DEFINE 0x80.1
P0_P02 DEFINE 0x80.2
P0_P03 DEFINE 0x80.3
P0_P04 DEFINE 0x80.4
P0_P05 DEFINE 0x80.5
P0_P06 DEFINE 0x80.6
P0_P07 DEFINE 0x80.7


TF1 DEFINE  TCON.7
TR1 DEFINE  TCON.6
TF0 DEFINE  TCON.5
TR0 DEFINE  TCON.4
IE1 DEFINE  TCON.3
IT1 DEFINE  TCON.2
IE0 DEFINE  TCON.1
IT0 DEFINE  TCON.0

SM0_FE DEFINE   SCON.7
SM1    DEFINE   SCON.6
SM2    DEFINE   SCON.5
REN    DEFINE   SCON.4
TB8    DEFINE   SCON.3
RB8    DEFINE   SCON.2
TI     DEFINE   SCON.1
RI     DEFINE   SCON.0

EA   DEFINE IE.7
ELVD DEFINE IE.6
EADC DEFINE IE.5
ES   DEFINE IE.4
ET1  DEFINE IE.3
EX1  DEFINE IE.2
ET0  DEFINE IE.1
EX0  DEFINE IE.0

PPCA DEFINE IP.7
PLVD DEFINE IP.6
PADC DEFINE IP.5
PS   DEFINE IP.4
PT1  DEFINE IP.3
PX1  DEFINE IP.2
PT0  DEFINE IP.1
PX0  DEFINE IP.0

CY  DEFINE PSW.7
AC  DEFINE PSW.6
F0  DEFINE PSW.5
RS1 DEFINE PSW.4
RS0 DEFINE PSW.3
OV  DEFINE PSW.2
P   DEFINE PSW.0

CF   DEFINE CCON.7
CR   DEFINE CCON.6
CCF3 DEFINE CCON.3
CCF2 DEFINE CCON.2
CCF1 DEFINE CCON.1
CCF0 DEFINE CCON.0

#endif /* __IAR_SYSTEMS_ASM__*/
#endif /* STC8_H */

